In [71]:
import pandas as pd

In [72]:
#Series de pandas
numeros=[1,2,3,4,5,6,7,8,9]
serie=pd.Series(numeros)
serie, type(serie)

(0    1
 1    2
 2    3
 3    4
 4    5
 5    6
 6    7
 7    8
 8    9
 dtype: int64,
 pandas.core.series.Series)

In [73]:
#Dataframe de pandas
#Es una estructura de datos bidimensional con columnas de diferentes tipos, similar a una hoja de cálculo o una tabla SQL.
diccionario = {"Nombre":["Juan","Ana","Jose","Arturo"],"Edad":[25,25,23,27],"Ciudad":["Barcelona","Madrid","Bilbao","Valencia"]}

#Creación de un dataframe a partir de un diccionario
df =  pd.DataFrame(diccionario)
df

   Nombre  Edad     Ciudad
0    Juan    25  Barcelona
1     Ana    25     Madrid
2    Jose    23     Bilbao
3  Arturo    27   Valencia

In [74]:
#Exportar DataFramed
df.to_csv("data.csv")

In [75]:
#Importar DataFramed
imported_df = pd.read_csv("data.csv",index_col=0)
imported_df

   Nombre  Edad     Ciudad
0    Juan    25  Barcelona
1     Ana    25     Madrid
2    Jose    23     Bilbao
3  Arturo    27   Valencia

In [76]:
#Seleccionar columnas
nombres = df['Nombre']
nombres

0      Juan
1       Ana
2      Jose
3    Arturo
Name: Nombre, dtype: object

In [77]:
#Seleccionar una o mas columnas
df[['Nombre','Edad']]

   Nombre  Edad
0    Juan    25
1     Ana    25
2    Jose    23
3  Arturo    27

In [78]:
#Filtrar por filas
fila = df.loc[0]
fila

Nombre         Juan
Edad             25
Ciudad    Barcelona
Name: 0, dtype: object

In [79]:
#Filtrar por condiciones
df[df['Edad']>20]

   Nombre  Edad     Ciudad
0    Juan    25  Barcelona
1     Ana    25     Madrid
2    Jose    23     Bilbao
3  Arturo    27   Valencia

In [80]:
filtro = (df["Edad"]>23) & (df["Nombre"].str.startswith("A"))
df[filtro]

   Nombre  Edad    Ciudad
1     Ana    25    Madrid
3  Arturo    27  Valencia

In [81]:
#Filtrar por querys
df.query('Edad>20')

   Nombre  Edad     Ciudad
0    Juan    25  Barcelona
1     Ana    25     Madrid
2    Jose    23     Bilbao
3  Arturo    27   Valencia

In [82]:
df[df["Nombre"].isin(["Juan","Ana"])]

  Nombre  Edad     Ciudad
0   Juan    25  Barcelona
1    Ana    25     Madrid

In [83]:
def nombre_con_4_letras(nombre):
    return len(nombre)==4

df[df["Nombre"].apply(nombre_con_4_letras)]

  Nombre  Edad     Ciudad
0   Juan    25  Barcelona
2   Jose    23     Bilbao

In [84]:
#Filtrar por endades entre 35 y 25
df[df["Edad"].between(25,25)]

  Nombre  Edad     Ciudad
0   Juan    25  Barcelona
1    Ana    25     Madrid

In [85]:
import numpy as np

In [86]:
dataNueva ={"Nombre":["Juan","Ana","Jose","Arturo"],"Edad":[25,np.nan,23,27],"Ciudad":["Barcelona","Madrid",None,"Valencia"]}

dataNueva_df = pd.DataFrame(dataNueva)
dataNueva_df

   Nombre  Edad     Ciudad
0    Juan  25.0  Barcelona
1     Ana   NaN     Madrid
2    Jose  23.0       None
3  Arturo  27.0   Valencia

In [87]:
#Rellenar los valores nulos
df_fill = dataNueva_df.fillna(
    {
        "Edad" : dataNueva_df["Edad"].mean(),
        "Ciudad" : "Desconocida"
    }
)

df_fill

   Nombre  Edad       Ciudad
0    Juan  25.0    Barcelona
1     Ana  25.0       Madrid
2    Jose  23.0  Desconocida
3  Arturo  27.0     Valencia

In [88]:
#Eliminar los valores nulos
df_drop = dataNueva_df.dropna()
df_drop

   Nombre  Edad     Ciudad
0    Juan  25.0  Barcelona
3  Arturo  27.0   Valencia

In [89]:
#Remplazazar valores especificos de alguna columna
df_replace = dataNueva_df.replace(
    {
        "Ciudad" : {None:"Desconocida"}
    }
)
df_replace

   Nombre  Edad       Ciudad
0    Juan  25.0    Barcelona
1     Ana   NaN       Madrid
2    Jose  23.0  Desconocida
3  Arturo  27.0     Valencia

In [90]:
#Interpolación de valores
df_interpol = dataNueva_df.copy()
df_interpol["Edad"]= dataNueva_df["Edad"].interpolate()
df_interpol

   Nombre  Edad     Ciudad
0    Juan  25.0  Barcelona
1     Ana  24.0     Madrid
2    Jose  23.0       None
3  Arturo  27.0   Valencia

Manejo de datos duplicados

In [94]:
data_duplicada = {
    "Nombre":["Juan","Ana","Jose","Arturo","Juan","Ana","Jose","Arturo"],
    "Edad":[25,25,np.nan,27,25,25,23,27],
    "Ciudad":["Barcelona","Madrid","Bilbao","Valencia","Barcelona","Madrid",None,"Valencia"]
}
df_duplicada= pd.DataFrame(data_duplicada)
df_duplicada

   Nombre  Edad     Ciudad
0    Juan  25.0  Barcelona
1     Ana  25.0     Madrid
2    Jose   NaN     Bilbao
3  Arturo  27.0   Valencia
4    Juan  25.0  Barcelona
5     Ana  25.0     Madrid
6    Jose  23.0       None
7  Arturo  27.0   Valencia

In [96]:
df_sin_duplicados = df_duplicada.drop_duplicates()
df_sin_duplicados

   Nombre  Edad     Ciudad
0    Juan  25.0  Barcelona
1     Ana  25.0     Madrid
2    Jose   NaN     Bilbao
3  Arturo  27.0   Valencia
6    Jose  23.0       None

Manejo de nombres de columnas

In [99]:
#Renombrar columnas
df_renombrado = df_duplicada.rename(columns={"Nombre":"name","Edad":"age","Ciudad":"city"})
df_renombrado

     name   age       city
0    Juan  25.0  Barcelona
1     Ana  25.0     Madrid
2    Jose   NaN     Bilbao
3  Arturo  27.0   Valencia
4    Juan  25.0  Barcelona
5     Ana  25.0     Madrid
6    Jose  23.0       None
7  Arturo  27.0   Valencia

In [100]:
#ordenar por columnas
columnas_ordenadas = ["Ciudad","Edad","Nombre"]
df_ordenado = df_duplicada[columnas_ordenadas]
df_ordenado

      Ciudad  Edad  Nombre
0  Barcelona  25.0    Juan
1     Madrid  25.0     Ana
2     Bilbao   NaN    Jose
3   Valencia  27.0  Arturo
4  Barcelona  25.0    Juan
5     Madrid  25.0     Ana
6       None  23.0    Jose
7   Valencia  27.0  Arturo

Transformación de Datos

In [103]:
def elevar_al_cuadrado(x):
    return x**2

df_duplicada["Edad_cuadrado"]= df_duplicada["Edad"].apply(elevar_al_cuadrado)
df_duplicada

   Nombre  Edad     Ciudad  Edad_cuadrado
0    Juan  25.0  Barcelona          625.0
1     Ana  25.0     Madrid          625.0
2    Jose   NaN     Bilbao            NaN
3  Arturo  27.0   Valencia          729.0
4    Juan  25.0  Barcelona          625.0
5     Ana  25.0     Madrid          625.0
6    Jose  23.0       None          529.0
7  Arturo  27.0   Valencia          729.0

Agrupación de datos

In [104]:
datos = {
    'Nombre':['Juan','Ana','Luis','Laura','Pedro','Carla'],
    'Ciudad':['Madrid','Barcelona','Bilbao','Madrid','Valencia','Barcelona'],
    'Edad':[25,23,23,27,25,25],
    'Puntuacion':[80,75,85,90,95,85]
}

df = pd.DataFrame(datos)
df

  Nombre     Ciudad  Edad  Puntuacion
0   Juan     Madrid    25          80
1    Ana  Barcelona    23          75
2   Luis     Bilbao    23          85
3  Laura     Madrid    27          90
4  Pedro   Valencia    25          95
5  Carla  Barcelona    25          85

In [106]:
#Agrupar por ciudad
grouped = df.groupby('Ciudad')
print(grouped.groups)

{'Barcelona': [1, 5], 'Bilbao': [2], 'Madrid': [0, 3], 'Valencia': [4]}

In [108]:
#Calcular la suma de las edades y puntuaciones por ciudad
df_aggregated = grouped.agg(
    {
        'Edad':'mean',
        'Puntuacion':'sum'
    }
)
df_aggregated

           Edad  Puntuacion
Ciudad
Barcelona  24.0         160
Bilbao     23.0          85
Madrid     26.0         170
Valencia   25.0          95

In [113]:
#Definir una función de agregación personalizada
def rango(x):
    return x.max()-x.min()
#aplicar la función de agregación personalizada
df_aggregated_custom = grouped.agg(
    {
        'Edad':rango,
        'Puntuacion': rango
    }
)

df_aggregated_custom

           Edad  Puntuacion
Ciudad
Barcelona     2          10
Bilbao        0           0
Madrid        2          10
Valencia      0           0

In [114]:
df['Categoria'] = ['A','B','A','B','A','B']
df

  Nombre     Ciudad  Edad  Puntuacion Categoria
0   Juan     Madrid    25          80         A
1    Ana  Barcelona    23          75         B
2   Luis     Bilbao    23          85         A
3  Laura     Madrid    27          90         B
4  Pedro   Valencia    25          95         A
5  Carla  Barcelona    25          85         B

In [116]:
#agrupación multinivel
grouped_multi= df.groupby(['Ciudad','Categoria'])
grouped_multi.groups

{('Barcelona', 'B'): [1, 5], ('Bilbao', 'A'): [2], ('Madrid', 'A'): [0], ('Madrid', 'B'): [3], ('Valencia', 'A'): [4]}

In [119]:
#calcular la suma de las edades y puntuaciones por ciudad y categoria
df_aggregated_multi = grouped_multi.agg(
    {
        'Edad':'mean',
        'Puntuacion':'mean'
    }
)
df_aggregated_multi

                     Edad  Puntuacion
Ciudad    Categoria
Barcelona B          24.0        80.0
Bilbao    A          23.0        85.0
Madrid    A          25.0        80.0
          B          27.0        90.0
Valencia  A          25.0        95.0

Agregar datos

In [121]:
data = {
    'Nombre': ['Juan', 'Ana', 'Luis', 'Laura'],
    'Edad': [25, 23, 23, 27],
}
df =pd.DataFrame(data)
df

  Nombre  Edad
0   Juan    25
1    Ana    23
2   Luis    23
3  Laura    27

In [122]:
#Agregar una nueva columna
df['Ciudad'] = ['Madrid', 'Barcelona', 'Bilbao', 'Madrid']
df

  Nombre  Edad     Ciudad
0   Juan    25     Madrid
1    Ana    23  Barcelona
2   Luis    23     Bilbao
3  Laura    27     Madrid

In [124]:
#generar una fila
new_row = pd.Series(['Pedro', 25, 'Valencia'], index=df.columns, name=4)

#agregar la fila al dataframe
df =pd.concat([df,new_row.to_frame().T],ignore_index=True)
df

  Nombre Edad     Ciudad
0   Juan   25     Madrid
1    Ana   23  Barcelona
2   Luis   23     Bilbao
3  Laura   27     Madrid
4  Pedro   25   Valencia
5  Pedro   25   Valencia